In [1]:
# Read the dataset from the below link
# https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_
# Names/US_Baby_Names_right.csv

# Questions:
# 3. Show the top 5 most preferred names

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("US_Baby_Names_right.csv")

In [4]:
df.head()

   Unnamed: 0  Unnamed: 0.1     Id     Name  Year Gender State  Count
0           0         11349  11350     Emma  2004      F    AK     62
1           1         11350  11351  Madison  2004      F    AK     48
2           2         11351  11352   Hannah  2004      F    AK     46
3           3         11352  11353    Grace  2004      F    AK     44
4           4         11353  11354    Emily  2004      F    AK     41

In [5]:
df.drop('Unnamed: 0',axis=1,inplace=True)
df.drop('Unnamed: 0.1',axis=1,inplace=True)
df.drop('Id',axis=1,inplace=True)

In [6]:
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [7]:
lst = df['Name'].unique()
lst.size

17632

In [8]:
df2 = df.groupby('Name').count().reset_index()
df3 = df2.sort_values(by='Count', ascending=False)
lst2 = df3['Name'].unique()
lst2.size

17632

In [9]:
df3.head()

         Name  Year  Gender  State  Count
14062   Riley  1112    1112   1112   1112
2174    Avery  1080    1080   1080   1080
8500   Jordan  1073    1073   1073   1073
13459  Peyton  1064    1064   1064   1064
6584   Hayden  1049    1049   1049   1049